export default {
  ftDashboard: {
    title: "Добро пожаловать в FinCloud",
    text1:
      "После регистрации Вам доступны возможности по учету Ваших личных финансов. Вы можете добавлять расходы и доходы, а так же вести свои счета.",
    text2:
      "Приложение позволяет добавлять счета, расходы и доходы. Так же, вы можете создавать учетные запаси на различные валюты. Доходы и расходы можно группировать и фильтровать. Подробнее про доходы, расходы и счеты Вы сможете узнать в соответсттвующих разделах приложения.",
    text3:
      "Для навигации по приложению используется меню. Оно расположено справа сверху.",
    text4:
      "На данный момент Вы находитесь в разделе статистики. Здесь будут представлены графики по Вашим доходам и расходам, а так же по их группам. Графики появятся после того как Вы добавите расходы или доходы за 2 и более дня.",
    text5:
      "Что бы добавть расход, доход или счет необходимо перейти из меню в соответствующий раздел приложения. Там Вы получите подробную инструкцию.",
  },
  ftCosts: {
    title: "Раздел Расходов",
    text1:
      "Вы находитесь в разделе Расходы. Здесь Вы можете добавлять и удалять расходы, их группы, фильтровать расходы по группам и счетам. ",
    text2:
      "Что бы добавить расход нужно кликнуть по кнопке + в правом нижнем углу экрана. После этого появится модальное окно. Заполните в этом окне наименование, дату, сумму, выбирите счет и группу. В этом же модальном окне Вы можете внести какие либо дополнительные сведения о расходе, но это не обязательно. После того как Вы все заполнили нажмите кнопку “Добавить”. И расход будет добавлен в  Вашу учетную запись. Из данного модального окна Вы можете добавить группу расхода. Для этого следует кликнуть на кнопку + рядом со списком групп расходов. Откроется модальное окно, где Вам нужно заполнить наименование группы и кликнуть кнопку Добавить.",
    text3:
      "Что бы удалить расход нужно кликнуть на кнопки X в правой верхней части карточки расхода.",
    text4:
      "В этом разделе Вы можете посмотреть статистику по группам или счетам отфильтровав расходы. Для этого нужно кликнуть на соответствуюющее название группы расхода или счета, которое указано в карточке расхода. После этого появится модальное окно с подробной информацией.",
  },
  ftIncomes: {
    title: "Раздел Доходов",
    text1:
      "Сейчас Вы находитесь в разделе Доходы. Здесь Вы можете добавлять и удалять доходы, их группы, а так же фильтровать доходы по их группам и счетам.",
    text2:
      "Что бы добавить доход нужно кликнуть по кнопке + в правом нижнем углу экрана. После этого появится модальное окно. Заполните в этом окне наименование, дату, сумму, выбирите счет и группу. В этом же модальном окне Вы можете внести какие либо дополнительные сведения о доходе, но это не обязательно. После того как Вы все заполнили нажмите кнопку “Добавить”. И доход будет добавлен в  Вашу учетную запись. Из данного модального окна Вы можете добавить группу дохода. Для этого следует кликнуть на кнопку + рядом со списком групп доходов. Откроется модальное окно, где Вам нужно заполнить наименование группы и кликнуть кнопку Добавить.",
    text3:
      "Что бы удалить доход нужно кликнуть на кнопки X в правой верхней части карточки дохода.",
    text4:
      "В этом разделе Вы можете посмотреть статистику по группам или счетам отфильтровав доходы. Для этого нужно кликнуть на соответствуюющее название группы дохода или счета, которое указано в карточке дохода. После этого появится модальное окно с подробной информацией.",
  },
  ftAccounts: {
    title: "Раздел Учетных записей",
    text1:
      "Сейчас Вы находитесь в разделе Учетные записи. Здесь Вы можете добавлять, редактировать и удалять свои Учетные записи. Учетная запись это основа в которой хранятся счета, расходы и доходы. Расходы одной Учетной записи никак не пересекаются с рахсодами другой Учетной записи. Учетных записей может быть сколько угодно. Можно создавать разные учетные записи на разную валюту. При регистрации в приложении Вам уже была создана Учетная запись в которой Вы сейчас и находитесь.",
    text2:
      "Что бы добавить Учетную запись необходимо кликнуть на кнопке + в правом нижнем углу экрана. После появится модальное окно, в котором необходимо заполнить наименование, начальный баланс, выбрать валюту. Так же Вы можете добавить какую либо дополнительную информацию по Вашей новой Учетной записи, но это не обязательно. Поле заполнения необходимых полей нужно кликнуть на кнопку Добавить и Учетная запиь будет создана.",
    text3:
      "Для того что бы переключится на другу Учетную запись, необходимо кликнуть на ее наименование в данном разделе. После переключения Учетной записи Вы будете перенаправлены в раздел Статистики. Выбранная Учетная запись выделена зеленый цветом.",
  },
  ftBudgets: {
    title: "Раздел Счета",
    text1:
      "Сейчас Вы находитесь в разделе Счета. Здесь Вы можете добавлять, редактировать и удалять счета на которые будут записываться расходы или доходы.",
    text2:
      "Что бы добавить счет нужно кликнуть на кнопке + в правом нижнем углу экрана. После появится модальное окно, в котором необходимо заполнить наименование Счета и кликнуть кнопку Добавить. После добалвения счета его баланс будет равен 0. Теперь Вы смоежет добавлять расходы и доходы на этот счет из соответствующих разделов приложения.",
    text3:
      "Так же, в этом разделе Вы можете посмотреть историю по данному счету. Для этого нужно кликнуть на наименование счета в карточки Счета. После появится модальное окнос подробной информацией по данному Счету на текущий месяц.",
  },
};
